//
//  BigCircle.m
//  DrawCircleBG
//
//  Created by 李 宇亮 on 6/2/16.
//  Copyright © 2016 hehe. All rights reserved.
//

#import "BigCircle.h"
#define POINT_X self.frame.size.width/2
#define POINT_Y self.frame.size.height/2
#define BigCircleRadious (POINT_X - 10)

@implementation BigCircle


// Only override drawRect: if you perform custom drawing.
// An empty implementation adversely affects performance during animation.
- (void)drawRect:(CGRect)rect {
    // Drawing code
    [self drawLargestCircle];

}


- (void)drawLargestCircle {
    CGContextRef context = UIGraphicsGetCurrentContext();
    CGContextSaveGState(context);
    
    
    
    
    
    // 绘制颜色渐变
    // 创建色彩空间对象
    CGColorSpaceRef colorSpaceRef = CGColorSpaceCreateDeviceRGB();
    CGFloat colors[] = {28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
        28/255.0, 164/255.0, 70/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
//        0, 149/255.0, 50/255.0, 1,
    
        0, 149/255.0, 50/255.0, 0.1,
    };
    CGGradientRef asdd = CGGradientCreateWithColorComponents(colorSpaceRef, colors, NULL, sizeof(colors)/(sizeof(colors[0])*4));
    
     // 释放色彩空间
    CGColorSpaceRelease(colorSpaceRef);
    CGContextDrawRadialGradient(context, asdd, CGPointMake(POINT_X, POINT_Y), 0, CGPointMake(POINT_X, POINT_Y), BigCircleRadious, kCGGradientDrawsBeforeStartLocation);
    
    
    // 释放渐变对象
    CGGradientRelease(asdd);
    
    CGContextAddArc(context, POINT_X, POINT_Y, POINT_X-1, 0, M_PI*2, 0);
    CGContextSetStrokeColorWithColor(context, [UIColor clearColor].CGColor);
    CGContextDrawPath(context, kCGPathStroke);
    CGContextRestoreGState(context);
}

@end
